Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

Описание решения:
1. Задаю массив произвольных строк с разным количеством символов.
2. Ввожу переменную (натуральное число) х, равное длине массива.
3. Ввожу произвольную строку result.
4. Использую цикл с индексом массива i = 0, условием i < x и счётчиком i++.
5. Внутри цикла проверяю условие array[i].Length <= 3 для каждого элемента. Если оно 
выполняется, то присваиваем result значение array[i] и последовательно выводим result 
в консоль.

string[] array = {"Moscow","All","4","France","U","Great"};
int x = array.Length;
string result = "random_string";
for (int i = 0; i < x; i++)
{
    if (array[i].Length <= 3)
    {
        result = array[i];
        Console.Write(result + " ");
    }
}
